app/views/technicians/show.html.erb

SELECT "roles".* FROM "roles" INNER JOIN "technician_roles" ON "roles"."id" = "technician_roles"."role_id" WHERE "technician_roles"."technician_id" = $1  [["technician_id", 1]]
---
              <p>I am a
                <% @technician.roles.each do |role| %>