app/views/movies/show.html.erb


        <% @movie.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1  [["movie_id", 1]]

          <div class="row">
            <% @movie.movie_technicians.each do |technician| %>
---
SELECT "movie_technicians".* FROM "movie_technicians" WHERE "movie_technicians"."movie_id" = $1  [["movie_id", 1]]