app/views/conversations/index.html.erb

SELECT  "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1 ORDER BY "messages"."id" DESC LIMIT $2  [["conversation_id", 1], ["LIMIT", 1]]
---
                      <span class="medium-small right blue-grey-text text-lighten-3">5.00 AM</span>
                      <p class="medium-small blue-grey-text text-lighten-3"><%= conversation.messages.first.content if conversation.messages.first %></p>