app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "commentable_type", "commentable_id", "commenter_type", "commenter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    comment = Comment.new(comment_params)
    if comment.save