app/controllers/conversations_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_conversation
      @conversation = Conversation.find(params[:id])