app/controllers/likes_controller.rb

INSERT INTO "likes" ("likeable_type", "likeable_id", "liker_type", "liker_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["likeable_type", "Review"], ["likeable_id", 1], ["liker_type", "User"], ["liker_id", 1], ["created_at", "2018-06-24 18:31:07.680337"], ["updated_at", "2018-06-24 18:31:07.680337"]]
---
  def create
    like = Like.new(like_params)
    if like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
  def destroy
    @like = Like.find(params[:id])
    @like.destroy