app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)
    if @message.save
---
INSERT INTO "messages" ("content", "conversation_id", "sendable_type", "sendable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "Hey bruh"], ["conversation_id", 1], ["sendable_type", "User"], ["sendable_id", 1], ["created_at", "2018-06-30 15:39:10.067614"], ["updated_at", "2018-06-30 15:39:10.067614"]]