app/controllers/movies_controller.rb

  def index
    @search = Movie.search(params[:q])
    @movies = @search.result.page(params[:page]).per(8)
---
SELECT "movies".* FROM "movies"
SELECT  "movies".* FROM "movies" LIMIT $1 OFFSET $2  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "movies"