app/controllers/technicians_controller.rb

SELECT  "technicians".* FROM "technicians" WHERE "technicians"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @technician = Technician.find(params[:id])

SELECT "technicians".* FROM "technicians"
SELECT  "technicians".* FROM "technicians" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "technicians"
---
  def index
    @search = Technician.search(params[:q])
    @technicians = @search.result.page(params[:page]).per(10)