app/controllers/users_controller.rb

  def index
    @search = User.search(params[:q])
    @users = @search.result.page(params[:page]).per(6)
---
SELECT COUNT(*) FROM "users"